package HomeWork9;

//Задание2.Создать квадратный массив размерностью NxN заполненный случайными числами,
// * вывести массив на экран в виде таблицы, найти наименьший и наибольший элемент
// * массива и вывести их на экран (если найдено несколько одинаковых элементов —
// * вывести через запятую индексы строки и столбца, где есть повторения). Вывести на экран
// * время выполнения поиска, в миллисекундах. Размерность массива должна
// * задаваться с клавиатуры.
public class Ex2 {
    public static void main(String[] args) {






    }
}
