package HomeWork6;

import java.util.Arrays;

// 1.Создать массив целых чисел на 4 элемента.
// Вывести его значения на экран.
public class Ex1 {
    public static void main(String[] args) {
        int [] mass = new int[]{2,5,8,7};
        System.out.println(Arrays.toString(mass));
    }
}
